###   Exercise

Hiring file contains hiring statics for a firm such as experience of candidate, his written test score and personal interview score. Based on these 3 factors, HR will decide the salary. Given this data, you need to build a machine learning model for HR department that can help them decide salaries for future candidates. Using this predict salaries for following candidates,

2 yr experience, 9 test score, 6 interview score

12 yr experience, 10 test score, 10 interview score

In [3]:
import pandas as pd
from sklearn.linear_model import LinearRegression
import joblib

#### read the data

In [4]:
df = pd.read_csv('hiring.csv')
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

#### handling missing values

In [5]:
df.experience.fillna('zero', inplace=True)
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0       zero                    8.0                           9      50000
1       zero                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [6]:
# test score mean to replace with the NAN value
test_score_mean = round(df['test_score(out of 10)'].mean())
test_score_mean

8

In [7]:
df['test_score(out of 10)'].fillna(test_score_mean, inplace=True)
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0       zero                    8.0                           9      50000
1       zero                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    8.0                           7      72000
7     eleven                    7.0                           8      80000

#### handling the string data

In [8]:
df.experience.replace(to_replace=['zero', 'two', 'three', 'five', 'seven', 'ten', 'eleven'], value=[0,2,3,5,7,10,11], inplace=True)
df

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0                    8.0                           9      50000
1           0                    8.0                           6      45000
2           5                    6.0                           7      60000
3           2                   10.0                          10      65000
4           7                    9.0                           6      70000
5           3                    7.0                          10      62000
6          10                    8.0                           7      72000
7          11                    7.0                           8      80000

#### Assigning Features and target variables

In [9]:
X = df.drop('salary($)', axis=1)
y = df['salary($)']
X

   experience  test_score(out of 10)  interview_score(out of 10)
0           0                    8.0                           9
1           0                    8.0                           6
2           5                    6.0                           7
3           2                   10.0                          10
4           7                    9.0                           6
5           3                    7.0                          10
6          10                    8.0                           7
7          11                    7.0                           8

In [10]:
y

0    50000
1    45000
2    60000
3    65000
4    70000
5    62000
6    72000
7    80000
Name: salary($), dtype: int64

#### Bulding and training the Linear Regression model

In [11]:
model = LinearRegression()
model.fit(X,y)

LinearRegression()

#### testing score of our model on the training data

In [12]:
model.score(X,y)

0.9616780002577959

Using this predict salaries for following candidates,
- 2 yr experience, 9 test score, 6 interview score
- 12 yr experience, 10 test score, 10 interview score

In [13]:
model.predict([[2,9,6]])

array([53205.96797671])

In [14]:
model.predict([[12,10,10]])

array([92002.18340611])

#### Assign theta_0, theta_1, theta_2, theta_3 parameters

In [15]:
theta_0 = model.intercept_
theta_1 = model.coef_[0]
theta_2 = model.coef_[1]
theta_3 = model.coef_[2]
print(f"theta_0 = {theta_0}\ntheta_1 = {theta_1}\ntheta_2 = {theta_2}\ntheta_3 = {theta_3}")

theta_0 = 17737.26346433771
theta_1 = 2812.954876273655
theta_2 = 1845.7059679767092
theta_3 = 2205.2401746724886

#### define our hypothesis function

In [16]:
def hypothesis_function(x1,x2,x3):
    return  theta_0 + theta_1*x1 + theta_2*x2 + theta_3*x3

#### testing the hypothesis function

In [17]:
hypothesis_function(2,9,6)

53205.96797671034

In [18]:
hypothesis_function(12,10,10)

92002.18340611353

#### save the model

In [19]:
joblib.dump('model', 'salaries prediction')

['salaries prediction']

#### Load the model

In [21]:
mj = joblib.load('salaries prediction')

#### Using the model again after loading it

In [ ]:
mj.pr